SROP6313/Arduino-underwater-ROV/SPI/ESP32_Webcombine/src/main.cpp
    function getTemper() {
      var xhttp = new XMLHttpRequest();
      xhttp.onreadystatechange = function() {
        if (xhttp.readyState == 4 && xhttp.status == 200) {
          document.getElementById("temperValue").innerHTML = xhttp.responseText;
        }
      };
      xhttp.open("GET", "readTemper", true);
      xhttp.send();
    }
    function getPressure() {
      var phttp = new XMLHttpRequest();
      phttp.onreadystatechange = function() {
        if (phttp.readyState == 4 && phttp.status == 200) {
          window.PressuValue = phttp.responseText;
          document.getElementById("pressureValue").innerHTML = PressuValue;
          var depthcm = (parseFloat(PressuValue) - oringinalpressure).toFixed(2);
          document.getElementById("depthValue").innerHTML = depthcm.toString();
        }
      };
      phttp.open("GET", "readPressure", true);
      phttp.send();
    }
    function depthzero(){
      oringinalpressure = parseFloat(PressuValue);
    }
    
    function getWarn() {
      var warnhttp = new XMLHttpRequest();
      warnhttp.onreadystatechange = function() {
        if (warnhttp.readyState == 4 && warnhttp.status == 200) {
          warn = parseInt(warnhttp.responseText);
          console.log(warn);  //主控台顯示warn值
          if(warn == 1 )
          {
            alert("警告!訊號過低");
          }
          if(warn == 3)
          {
            alert("警告!電池電壓過低");
          }
        }
      };      
      warnhttp.open("GET", "readWarn", true);
      warnhttp.send();
    }
    
    var index;
    
    var app = new Vue({
      el: '#app',
      data: {
      currentStep: null,
      steps: [
        {"label": "back2"},
        {"label": "back1"},
        {"label": "stop"},
        {"label": "forward1"},
        {"label": "forward2"},
        {"label": "forward3"},
      ]
      },
      methods: {
        nextStep(next=true) {
          const steps = this.steps
          const currentStep = this.currentStep
          const currentIndex = steps.indexOf(currentStep)
          if (steps[index]) {
            if(index >= 0 && index <=5)
            {
              return this.currentStep = steps[index]
            }
          }

          this.currentStep = { "label": "complete" }
        },
        stepClasses(index) {
          let result = `progress__step progress__step--${index + 1} `
          if (this.currentStep && this.currentStep.label === 'complete' ||
          index < this.steps.indexOf(this.currentStep)) {
            return result += 'progress__step--complete'
          }
          if (index === this.steps.indexOf(this.currentStep)) {
            return result += 'progress__step--active'
          }
          return result
        }
      },
      computed: {
        progressClasses() {
          let result = 'progress '
          if (this.currentStep && this.currentStep.label === 'complete') {
          return result += 'progress--complete'
          }
          return result += `progress--${this.steps.indexOf(this.currentStep) + 1}`
        }
      }
    })
    function getSpeedstatus() {
      var statushttp = new XMLHttpRequest();
      statushttp.onreadystatechange = function() {
        if (statushttp.readyState == 4 && statushttp.status == 200){
          window.index = parseInt(statushttp.responseText) - 3;
          console.log("index:" + index);  //主控台顯示warn值
        }
      };
      statushttp.open("GET", "readStatus", true);
      statushttp.send();
    }
    function getBatstatus() {
      var batstatushttp = new XMLHttpRequest();
      batstatushttp.onreadystatechange = function() {
        if (batstatushttp.readyState == 4 && batstatushttp.status == 200){
          var batteryvalue = parseInt(batstatushttp.responseText);
          if(batteryvalue == 100)
          {
            document.getElementById("battery").className = "fa fa-battery-4";
            document.getElementById("battery").style.color = "blue";
          }  
          else if(batteryvalue == 80) 
          {
            document.getElementById("battery").className = "fa fa-battery-3";
            document.getElementById("battery").style.color = "blue";
          }
          else if(batteryvalue == 60) 
          {
            document.getElementById("battery").className = "fa fa-battery-2";
            document.getElementById("battery").style.color = "blue";
          }
          else if(batteryvalue == 40) 
          {
            document.getElementById("battery").className = "fa fa-battery-1";
            document.getElementById("battery").style.color = "red";
          }
          else if(batteryvalue == 20) 
          {
            document.getElementById("battery").className = "fa fa-battery-0";
            document.getElementById("battery").style.color = "red";
          }  
        }
      };
      batstatushttp.open("GET", "readBatStatus", true);
      batstatushttp.send();
    }
    </script>
  </body> 
</html>
)rawliteral";

static esp_err_t index_handler(httpd_req_t *req){
  httpd_resp_set_type(req, "text/html");
  return httpd_resp_send(req, (const char *)INDEX_HTML, strlen(INDEX_HTML));
}

byte m_send;   //中斷要改變的值設為 volatile
int LEDstatus = LOW;
bool stablestart = false;
bool pressrecord = false;

static esp_err_t cmd_handler(httpd_req_t *req){
  char*  buf;
  size_t buf_len;
  char variable[32] = {0,};
  
  buf_len = httpd_req_get_url_query_len(req) + 1;
  if (buf_len > 1) {
    buf = (char*)malloc(buf_len);
    if(!buf){
      httpd_resp_send_500(req);
      return ESP_FAIL;
    }
    if (httpd_req_get_url_query_str(req, buf, buf_len) == ESP_OK) {
      if (httpd_query_key_value(buf, "go", variable, sizeof(variable)) == ESP_OK) {
      } else {
        free(buf);
        httpd_resp_send_404(req);
        return ESP_FAIL;
      }
    } else {
      free(buf);
      httpd_resp_send_404(req);
      return ESP_FAIL;
    }
    free(buf);
  } else {
    httpd_resp_send_404(req);
    return ESP_FAIL;
  }

  int res = 0;

  if(!strcmp(variable, "forward")) {
    Serial.println("f");
    m_send = 'f';
    stablestart = false;
  }
  else if(!strcmp(variable, "left")) {
    Serial.println("l");
    m_send = 'l';
    stablestart = false;
  }
  else if(!strcmp(variable, "right")) {
    Serial.println("r");
    m_send = 'r';
    stablestart = false;
  }
  else if(!strcmp(variable, "backward")) {
    Serial.println("b");
    m_send = 'b';
    stablestart = false;
  }
  else if(!strcmp(variable, "stop")) {
    Serial.println("t");
    m_send = 't';
    stablestart = false;
  }
  else if(!strcmp(variable, "stable")) {
    Serial.println("s");
    m_send = 's';
    stablestart = true;
    pressrecord = true;
  }
  else if(!strcmp(variable, "hold")) {
    Serial.println("h");
    m_send = 'h';
    stablestart = false;
  }
  else if(!strcmp(variable, "release")) {
    Serial.println("m");
    m_send = 'm';
    stablestart = false;
  }
  else if(!strcmp(variable, "armup")) {
    Serial.println("a");
    m_send = 'a';
    stablestart = false;
  }
  else if(!strcmp(variable, "armdown")) {
    Serial.println("q");
    m_send = 'q';
    stablestart = false;
  }
  else if(!strcmp(variable, "dive")) {
    Serial.println("d");
    m_send = 'd';
    stablestart = false;
  }
  else if(!strcmp(variable, "rise")) {
    Serial.println("e");
    m_send = 'e';
    stablestart = false;
  }
  else if(!strcmp(variable, "reset")) {
    Serial.println("x");
    m_send = 'x';
  }
  else if(!strcmp(variable, "light")) {
    Serial.println("light");
    LEDstatus = !LEDstatus;
    digitalWrite(LED_PIN, LEDstatus);
  }
  else {
    res = -1;
  }

  if(res){
    return httpd_resp_send_500(req);
  }

  httpd_resp_set_hdr(req, "Access-Control-Allow-Origin", "*");
  return httpd_resp_send(req, NULL, 0);
}

void startCameraServer(){
  httpd_config_t config = HTTPD_DEFAULT_CONFIG();
  config.server_port = 80;
  httpd_uri_t index_uri = {
    .uri       = "/",
    .method    = HTTP_GET,
    .handler   = index_handler,
    .user_ctx  = NULL
  };

  httpd_uri_t cmd_uri = {
    .uri       = "/action",
    .method    = HTTP_GET,
    .handler   = cmd_handler,
    .user_ctx  = NULL
  };
  ESP_LOGI(TAG, "Starting web server on port: '%d'", config.server_port);
  if (httpd_start(&camera_httpd, &config) == ESP_OK) {
    httpd_register_uri_handler(camera_httpd, &index_uri);
    httpd_register_uri_handler(camera_httpd, &cmd_uri);
  }
  config.server_port += 1;
  config.ctrl_port += 1;
}

void handleRoot() {
 String s = INDEX_HTML; //Read HTML contents
 server.send(200, "text/html", s); //Send web page
}

String temperature, pressure;

void handleTemper() { 
  String temperValue = temperature;
  server.send(200, "text/plane", temperValue); //Send ADC value only to client ajax request
}

void handlePressure() { 
  String pressureValue = pressure;
  server.send(200, "text/plane", pressureValue); //Send ADC value only to client ajax request
}

