SROP6313/Arduino-underwater-ROV/SPI/ESP32_Webcombine/src/main.cpp
String w;
void handleWarn(){
  String Warn = w;
  server.send(200, "text/plane", Warn); //Send RSSI only to client ajax request
}

byte m_receive;
void handleSpeedstatus(){
  String Status = String(m_receive);
  server.send(200, "text/plane", Status);
}

String batteryvalue;
void handleBatterystatus(){
  String BatStatus = batteryvalue;
  server.send(200, "text/plane", BatStatus);
}

MS5837 sensor;

void setup () {
  Serial.begin(115200); //set baud rate to 115200 for usart
  digitalWrite(SS, HIGH); // disable Slave Select
  SPI.begin(ESP32_CAM_SCK,  ESP32_CAM_MISO, ESP32_CAM_MOSI, ESP32_CAM_SS);
  SPI.setClockDivider(SPI_CLOCK_DIV16);//divide the clock by 8
  
  WRITE_PERI_REG(RTC_CNTL_BROWN_OUT_REG, 0); //disable brownout detector
  
  Serial.setDebugOutput(false);
  Wire.begin(I2C_SDA, I2C_SCL);
  
  pinMode(LED_PIN, OUTPUT);
  digitalWrite(LED_PIN, LOW);
  
  // Wi-Fi connection
  WiFi.setSleep(false);
  WiFi.mode (WIFI_STA);
  WiFi.setAutoReconnect(true);

  WiFi.begin(ssid, password);
  while (WiFi.status() != WL_CONNECTED) {
    delay(500);
    // Serial.print(".");
  }
  Serial.println("");
  Serial.println("WiFi connected");
  
  Serial.print("Camera Stream Ready! Go to: http://");
  Serial.println(WiFi.localIP());

  server.on("/", handleRoot);      //This is display page
  server.on("/readTemper", handleTemper);//To get update of ADC Value only
  server.on("/readPressure", handlePressure);
  server.on("/readWarn", handleWarn);//To get update of RSSI only
  server.on("/readStatus", handleSpeedstatus);
  server.on("/readBatStatus", handleBatterystatus);
  
  // Start streaming web server
  startCameraServer();
  server.begin();

  sensor.init();
  sensor.setModel(MS5837::MS5837_30BA);
  sensor.setFluidDensity(997); // kg/m^3 (freshwater, 1029 for seawater)
}

float tempera, pressu;
int sensernum = 0;
int SPIsendnum = 0;
long warnnum = 0;
int originalpressure;
int previouspressure;
int Dpressure;
int Bpressure;
int Apressure;
int Epressure;
int DepthStableCount = 0;
char flag = 'C';
int dampcount = 0;
//int timecount = 0;

void loop () {
  server.handleClient();

  warnnum++;
  if(warnnum >= 1000)
  {
    warnnum = 0;
    if(WiFi.RSSI()<(-200))     //RSSI小於-200跳警告
    {
      w = 1;
    }
    else
    {
      w = 2;
    }
  }

  SPIsendnum++;
  if(SPIsendnum >= 100)
  {
    SPIsendnum = 0;
    char c = m_send;
    digitalWrite(SS, LOW); // enable Slave Select
    m_receive = SPI.transfer(c);

    if(m_receive == 'w') 
    {
      w = 3;
      batteryvalue = 20;
    }
    else if(m_receive == 'o') batteryvalue = 40;
    else if(m_receive == 'i') batteryvalue = 60;
    else if(m_receive == 'u') batteryvalue = 80;
    else if(m_receive == 'y') 
    {
      batteryvalue = 100;
    }
       
    m_send = 0;
    Serial.println(m_receive);
  }

  sensernum++;
  if(sensernum >= 250)  //約200ms讀取一次溫度
  {
    sensernum = 0;
    sensor.read();   //函式裡有 delay 40 ms
    // Serial.print("Temperature: "); 
    // Serial.print(sensor.temperature()); 
    // Serial.println(" deg C");
    // timecount++;
    //Serial.println(timecount);
    tempera = sensor.temperature();
    pressu = sensor.pressure();
    Serial.println(pressu);
    if(stablestart)
    {
      if(pressrecord)
      {
        originalpressure = pressu;
        previouspressure = pressu;
        Dpressure = originalpressure + 3;
        Bpressure = originalpressure - 3;
        Apressure = originalpressure - 5;
        Epressure = originalpressure + 5;
        pressrecord = false;
      }

      DepthStableCount++;
      if(DepthStableCount >= 1)  //約400ms 作動一次
      {
        DepthStableCount = 0;
        if(pressu <= Bpressure)   //B上方
        {
          dampcount = 0;
          if(flag == 'C' || flag == 'D') flag = 'B';       
          if(pressu <= Apressure && pressu <= previouspressure)
          {
            flag = 'A';
            m_send = 'p';   //dive 8
          }
          else   // between A & B
          {
            if(flag == 'B' && pressu <= previouspressure)
            {
              m_send = 'g';   //dive 2
            }
            else if(flag == 'A' && pressu > previouspressure)
            {
              m_send = 'k';   //rise 2
            }
          }
        }
        else if(pressu >= Dpressure)  //D下方
        {
          dampcount = 0;
          if(flag == 'C' || flag == 'B') flag = 'D';       
          if(pressu >= Epressure && pressu >= previouspressure)
          {
            flag = 'E';
            m_send = 'j';   //rise 4
          }
          else   // between D & E
          {
            if(flag == 'D' && pressu >= previouspressure)
            {
              m_send = 'k';   //rise 2
            }
            else if(flag == 'E' && pressu < previouspressure)
            {
              m_send = 'g';   //dive 2
            }
          }
        }
        else  //between B & D
        {
          if(flag == 'A' || flag == 'B')
          {
            flag = 'B';
            dampcount++;
            if(dampcount <= 5)
            {
              m_send = 'k';   //rise 2
            }       
            else if(dampcount <= 10)
            {
              m_send = 'g';   //dive 2
            }
          }
          else if(flag == 'D' || flag == 'E')
          {
            flag = 'D';
            dampcount++;
            if(dampcount <= 5)
            {             
              m_send = 'g';   //dive 2
            }       
            else if(dampcount <= 10)
            {
              m_send = 'k';   //rise 2
            }
          }
        }
      }
      previouspressure = pressu;
    }
    temperature = String(tempera,2);
    pressure = String(pressu,2);
    //Serial.println(WiFi.RSSI());
  }
}